providers/stripe/test/read/payment_intents/expand_payment_method_charge.json

{
    "id": "pi_3SsAwzF6iHem4voo03GfTErP",
    "object": "payment_intent",
    "amount": 100,
    "amount_capturable": 0,
    "amount_details": {
        "tip": {}
    },
    "amount_received": 100,
    "application": null,
    "application_fee_amount": null,
    "automatic_payment_methods": null,
    "canceled_at": null,
    "cancellation_reason": null,
    "capture_method": "automatic_async",
    "client_secret": "pi_3SsAwzF6iHem4voo03GfTErP_secret_cLacs6iNKmMRMqiarD3eWtUJ8",
    "confirmation_method": "automatic",
    "created": 1769038597,
    "currency": "usd",
    "customer": null,
    "customer_account": null,
    "description": null,
    "excluded_payment_method_types": null,
    "invoice": null,
    "last_payment_error": null,
    "latest_charge": {
        "id": "ch_3SsAwzF6iHem4voo0kHo2r3C",
        "object": "charge",
        "amount": 100,
        "amount_captured": 100,
        "amount_refunded": 0,
        "application": null,
        "application_fee": null,
        "application_fee_amount": null,
        "balance_transaction": "txn_3SsAwzF6iHem4voo0PDFpjjo",
        "billing_details": {
            "address": {
                "city": null,
                "country": null,
                "line1": null,
                "line2": null,
                "postal_code": null,
                "state": null
            },
            "email": null,
            "name": null,
            "phone": null,
            "tax_id": null
        },
        "calculated_statement_descriptor": "Stripe",
        "captured": true,
        "created": 1769038597,
        "currency": "usd",
        "customer": null,
        "description": null,
        "destination": null,
        "dispute": null,
        "disputed": false,
        "failure_balance_transaction": null,
        "failure_code": null,
        "failure_message": null,
        "fraud_details": {},
        "invoice": null,
        "livemode": false,
        "metadata": {},
        "on_behalf_of": null,
        "order": null,
        "outcome": {
            "advice_code": null,
            "network_advice_code": null,
            "network_decline_code": null,
            "network_status": "approved_by_network",
            "reason": null,
            "risk_level": "normal",
            "risk_score": 27,
            "seller_message": "Payment complete.",
            "type": "authorized"
        },
        "paid": true,
        "payment_intent": "pi_3SsAwzF6iHem4voo03GfTErP",
        "payment_method": "pm_1SsAwzF6iHem4voorZHZEMKc",
        "payment_method_details": {
            "card": {
                "amount_authorized": 100,
                "authorization_code": "815826",
                "brand": "visa",
                "checks": {
                    "address_line1_check": null,
                    "address_postal_code_check": null,
                    "cvc_check": "pass"
                },
                "country": "US",
                "exp_month": 1,
                "exp_year": 2027,
                "extended_authorization": {
                    "status": "disabled"
                },
                "fingerprint": "dHBG1eWHBeZi1Ja1",
                "funding": "credit",
                "incremental_authorization": {
                    "status": "unavailable"
                },
                "installments": null,
                "last4": "4242",
                "mandate": null,
                "multicapture": {
                    "status": "unavailable"
                },
                "network": "visa",
                "network_token": {
                    "used": false
                },
                "network_transaction_id": "100726671491018",
                "overcapture": {
                    "maximum_amount_capturable": 100,
                    "status": "unavailable"
                },
                "regulated_status": "unregulated",
                "three_d_secure": null,
                "wallet": null
            },
            "type": "card"
        },
        "radar_options": {},
        "receipt_email": null,
        "receipt_number": null,
        "receipt_url": "https://pay.stripe.com/receipts/payment/CAcaFwoVYWNjdF8xTmNFZmtGNmlIZW00dm9vKLHGxcsGMgZVibb6bj46LBbLwa1d6_Bb4lvYDgeiJx3UTzBoqD2LJGhySwL6igWXyMnOesIhwyDIthnV",
        "refunded": false,
        "review": null,
        "shipping": null,
        "source": null,
        "source_transfer": null,
        "statement_descriptor": null,
        "statement_descriptor_suffix": null,
        "status": "succeeded",
        "transfer_data": null,
        "transfer_group": null
    },
    "livemode": false,
    "metadata": {},
    "next_action": null,
    "on_behalf_of": null,
    "payment_method": {
        "id": "pm_1SsAwzF6iHem4voorZHZEMKc",
        "object": "payment_method",
        "allow_redisplay": "unspecified",
        "billing_details": {
            "address": {
                "city": null,
                "country": null,
                "line1": null,
                "line2": null,
                "postal_code": null,
                "state": null
            },
            "email": null,
            "name": null,
            "phone": null,
            "tax_id": null
        },
        "card": {
            "brand": "visa",
            "checks": {
                "address_line1_check": null,
                "address_postal_code_check": null,
                "cvc_check": "pass"
            },
            "country": "US",
            "display_brand": "visa",
            "exp_month": 1,
            "exp_year": 2027,
            "fingerprint": "dHBG1eWHBeZi1Ja1",
            "funding": "credit",
            "generated_from": null,
            "last4": "4242",
            "networks": {
                "available": [
                    "visa"
                ],
                "preferred": null
            },
            "regulated_status": "unregulated",
            "three_d_secure_usage": {
                "supported": true
            },
            "wallet": null
        },
        "created": 1769038597,
        "customer": null,
        "customer_account": null,
        "livemode": false,
        "metadata": {},
        "type": "card"
    },
    "payment_method_configuration_details": null,
    "payment_method_options": {
        "card": {
            "installments": null,
            "mandate_options": null,
            "network": null,
            "request_three_d_secure": "automatic"
        }
    },
    "payment_method_types": [
        "card"
    ],
    "processing": null,
    "receipt_email": null,
    "review": null,
    "setup_future_usage": null,
    "shipping": null,
    "source": null,
    "statement_descriptor": null,
    "statement_descriptor_suffix": null,
    "status": "succeeded",
    "transfer_data": null,
    "transfer_group": null
}